{
  "backend/main.mo": "Main Motoko actor defining user profiles, tests, courses, OTP logic, Stripe checkout mappings, and access‑controlled queries with storage and authorization mixins.",
  "backend/migration.mo": "Defines old/new user profile shapes and provides a no-op migration that forwards the old actor state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of all major frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind base and theme variables defining red‑blue premium color system, dark mode overrides, and global element styling.",
  "frontend/index.html": "HTML entry point with Google verification meta tag, sitemap link, and root mount point for the React app.",
  "frontend/public/sitemap.xml": "XML sitemap listing all key public site pages with metadata for search indexing.",
  "frontend/src/App.tsx": "Main React app with routing, query client setup, error boundary, session-state checks, and lazy‑loaded pages.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, contact info fetched from a query, and an about section.",
  "frontend/src/components/Header.tsx": "Implements a responsive header with navigation, user session handling, profile menu, and login/signup modals.",
  "frontend/src/components/LoginModal.tsx": "Provides a mobile OTP-based login flow with OTP sending, verification, error handling, and countdown logic.",
  "frontend/src/components/MobileLoginModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for completing user profile details including name, mobile, email, and optional photo upload with progress tracking.",
  "frontend/src/components/SignupModal.tsx": "Deprecated signup modal displaying a notice directing users to the mobile OTP login flow.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity loading, and session management.",
  "frontend/src/hooks/useMobileAuth.ts": "Provides mobile OTP authentication with retry logic, actor readiness checks, and Internet Identity login handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, mock tests, courses, syllabi, and session state via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with a custom red‑blue theme, dark mode variables, utility classes, and animation helpers.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPanel.tsx": "Renders the admin dashboard with tabs for managing users, mock tests, courses, syllabi, and Stripe settings, gated by admin role.",
  "frontend/src/pages/CoursesPage.tsx": "Displays all video courses grouped by subject with duration summaries and expandable video lists.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing platform features, login/signup options, and navigation to major sections.",
  "frontend/src/pages/MockTestsPage.tsx": "Displays mock tests by subject, supports purchasing via Stripe checkout, with loading and filtering states.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a failure message after an unsuccessful payment and provides navigation buttons.",
  "frontend/src/pages/PaymentSuccess.tsx": "Confirms a successful payment and gives quick access to mock tests or progress.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to view and update their profile details, including name, mobile, and photo upload.",
  "frontend/src/pages/ProgressPage.tsx": "Displays charts and metrics summarizing a user's test performance and improvement over time.",
  "frontend/src/pages/SyllabusPage.tsx": "Fetches and displays subject-wise syllabi with expandable topic lists.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended colors, spacing, and custom theme utilities.",
  "project_state.json": "JSON snapshot of the project's state containing features, requirements, issues, and metadata for Exam Xpresss."
}