{
  "backend/main.mo": "Defines core actor with user profiles, courses, mock tests, OTP, purchases, and access control state plus various validation and helper logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related components, affected files, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files across components, hooks, pages, and styles.",
  "frontend/index.css": "Global Tailwind CSS variables and theming definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry with favicon links, sitemap reference, Google verification, and script mounting root app.",
  "frontend/public/sitemap.xml": "XML sitemap enumerating major public site pages with metadata for search engines.",
  "frontend/src/App.tsx": "Main React app with routing, lazy-loaded pages, query client config, error boundary, and session/auth handling.",
  "frontend/src/components/Footer.tsx": "A memoized footer component showing brand info, social links, quick navigation buttons, and contact details.",
  "frontend/src/components/Header.tsx": "A memoized header with navigation buttons, branding, authentication controls, and a user dropdown menu.",
  "frontend/src/components/LoginModal.tsx": "An OTP-based login modal handling mobile input, OTP sending and verification, connection states, and error messaging.",
  "frontend/src/components/MobileLoginModal.tsx": "A mobile-focused OTP login modal with two-step flow, countdown timer, error display, and clipboard OTP copy support.",
  "frontend/src/components/ProfileSetupModal.tsx": "A profile setup modal allowing users to enter personal details, upload an avatar, and submit updates via backend API.",
  "frontend/src/components/SignupModal.tsx": "A deprecated signup modal simply notifying users to use mobile OTP login instead.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, wrapping AuthClient and exposing identity state, login, and logout utilities.",
  "frontend/src/hooks/useMobileAuth.ts": "Implements mobile OTP-based authentication with actor readiness checks, II login enforcement, retry logic, and connection state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for interacting with backend actors, covering user profiles, mock tests, courses, syllabi, and related mutations.",
  "frontend/src/index.css": "Configures Tailwind base styles with a red‑blue theme, dark mode variables, utility classes, animations, and UI enhancements.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminPanel.tsx": "Renders an admin dashboard with tabs for users, mock tests, courses, syllabi, and Stripe settings, enforcing admin access via session state.",
  "frontend/src/pages/CoursesPage.tsx": "Displays all video courses grouped by subject with loading states and expandable video lists. Uses accent styling and memoized course cards.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero section, feature cards, and call‑to‑action buttons. Navigation varies based on authentication.",
  "frontend/src/pages/MockTestsPage.tsx": "Lists mock tests with subject filters and purchase flow via Stripe checkout. Handles loading, purchase state, and tabbed subject views.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a styled error card after a failed payment with actions to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a success card after payment with navigation to mock tests, courses, or home.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to view and update profile info including name, photo upload with progress, and mobile validation. Syncs with backend profile APIs.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user progress metrics and charts using test results and progress queries, with brand-accented UI components.",
  "frontend/src/pages/SyllabusPage.tsx": "Fetches and displays syllabi with topic accordions, using brand-accented cards and loaders.",
  "frontend/src/utils/accents.ts": "Provides red/blue brand accent class helpers for cards, badges, buttons, tabs, metric cards, charts, and legacy mappings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining brand color safelist, theme extensions, plugins, and container settings.",
  "project_state.json": "Project metadata describing features, issues, required assets, and build/deployment context for Exam Xpresss."
}