{
  "backend/main.mo": "Motoko backend actor defining user profiles, tests, courses, sessions, OTP flow, Stripe checkout data, and authorization checks with various in-memory maps.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, test IDs, and confidence levels for build restoration and deployment validation.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing component behavior, styling systems, routing, and build-related fixes.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens for light/dark themes and applying global background, text, and border styles.",
  "frontend/index.html": "HTML entry point setting favicon paths, sitemap reference, Google verification, and loading the React app.",
  "frontend/public/sitemap.xml": "XML sitemap listing key site URLs with last-modified dates, change frequency, and priority metadata.",
  "frontend/src/App.tsx": "Main React app establishing routing, session-based authentication, lazy‑loaded pages, error boundaries, and profile‑setup modal logic.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, social links, navigation shortcuts, and build version display using red/blue theme classes.",
  "frontend/src/components/Header.tsx": "Header component with navigation, branding, and user menu integrating Internet Identity and logout handling.",
  "frontend/src/components/LoginModal.tsx": "Mobile OTP login modal handling OTP send, verification, connection states, and error feedback.",
  "frontend/src/components/MobileLoginModal.tsx": "Alternative mobile login modal managing OTP generation, verification, countdown, and copy-to-clipboard behavior.",
  "frontend/src/components/ProfileSetupModal.tsx": "Profile setup modal allowing users to submit name, mobile, email, and avatar upload with progress tracking.",
  "frontend/src/components/SignupModal.tsx": "Deprecated signup modal showing a notice directing users to mobile OTP authentication.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login, logout, and identity persistence.",
  "frontend/src/hooks/useMobileAuth.ts": "Implements mobile OTP authentication flow with retries, actor readiness checks, and Internet Identity integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, tests, courses, syllabi, and Stripe settings via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, utility classes, animations, and styling enhancements.",
  "frontend/src/main.tsx": "Bootstraps the app by rendering React root with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminPanel.tsx": "Renders the admin dashboard with tabs for managing users, mock tests, courses, syllabi, and Stripe settings with role-based access.",
  "frontend/src/pages/CoursesPage.tsx": "Displays all video courses grouped by subject with detailed course cards and video accordions.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, key features, and navigation options with auth‑based actions.",
  "frontend/src/pages/MockTestsPage.tsx": "Displays mock tests grouped by subject with purchase handling via checkout sessions.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a payment failure message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a payment success message and links to access purchased content.",
  "frontend/src/pages/ProfilePage.tsx": "User profile editor supporting name, mobile, and photo upload with validation and save logic.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user progress metrics and charts based on test results and activity data.",
  "frontend/src/pages/SyllabusPage.tsx": "React page that fetches and displays syllabi using cards and accordions with dynamic accent styles.",
  "frontend/src/utils/accents.ts": "Provides brand accent utilities for generating Tailwind class strings for red/blue themes and alternating UI styles.",
  "frontend/src/utils/buildInfo.ts": "Defines build metadata and a helper to return the current draft version string.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with brand color safelists, plugins, and extended theme settings.",
  "project_state.json": "Project state file tracking schema version, issues, and feature requests for the Exam Xpresss project."
}