{
  "backend/main.mo": "Main backend actor implementing user authentication (OTP-based), profile management, mock tests, courses, syllabus, test results, Stripe payment integration, and admin controls with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting the logo size adjustment in the Header component with circular styling, listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files with details on red-blue brand color system, authentication flows, and UI implementations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color tokens for light and dark modes, defining design system variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with meta tags, Google Search Console verification, sitemap reference, favicon links (16x16, 32x32, 180x180), and React app mount point.",
  "frontend/public/sitemap.xml": "XML sitemap listing all main public pages (home, mock-tests, courses, syllabus, progress, profile, contact) with lastmod dates, changefreq, and priority values for SEO.",
  "frontend/src/App.tsx": "Main application component with URL-synchronized routing, Internet Identity authentication, session state management, profile setup modal, error boundaries, and lazy-loaded page components.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Exam Xpresss branding with circular logo, social media links, quick navigation with red/blue brand colors, contact information, and build version in copyright.",
  "frontend/src/components/Header.tsx": "Header component with navigation menu, logo, and user authentication dropdown. Displays navigation items (Home, Mock Tests, Courses, Syllabus, Progress) with color-coded active states and handles user profile/logout actions.",
  "frontend/src/components/LoginModal.tsx": "Modal dialog for mobile OTP-based authentication with two-step flow: mobile number entry and OTP verification. Includes connection status indicators, countdown timer, retry logic, and service error handling.",
  "frontend/src/components/MobileLoginModal.tsx": "Alternative mobile login modal with OTP generation and verification steps. Features countdown timer, OTP copy-to-clipboard functionality, and two-step authentication flow (mobile entry then OTP verification).",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for completing user profile setup after authentication. Collects name, mobile, email, and profile photo with image upload/preview, pre-fills mobile from OTP session, and includes validation and upload progress tracking.",
  "frontend/src/components/SignupModal.tsx": "Deprecated signup modal component that displays a notice directing users to use mobile OTP login instead. No longer functional, kept for reference.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles both authenticated and anonymous actors, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY AuthClient. Manages authentication state (initializing, logging-in, success, error), identity persistence, login/logout flows, and provides authentication context to child components.",
  "frontend/src/hooks/useMobileAuth.ts": "Custom React hook for mobile authentication via OTP, managing connection status, Internet Identity login, actor initialization with retry logic and exponential backoff, and OTP generation/verification flows.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend API calls including user profiles, mock tests, courses, syllabi, test results, shopping cart, Stripe configuration, and user purchases with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom red-blue premium theme variables for light/dark modes, brand colors, utility classes for animations, GPU acceleration, hover effects, and admin editor styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabbed interface for managing users, mock tests, courses, syllabus, and Stripe configuration, with role-based access control and CRUD operations for all content types.",
  "frontend/src/pages/CoursesPage.tsx": "Public-facing courses page displaying video courses grouped by subject with accordion-based video listings, duration calculations, and subject-specific color theming.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying hero section, feature cards (mock tests, courses, progress, syllabus), benefits list, and CTA buttons with brand-colored styling and navigation props.",
  "frontend/src/pages/MockTestsPage.tsx": "Displays available mock tests in a tabbed interface filtered by subject, with purchase functionality via Stripe checkout and subject-specific accent colors.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error message and navigation buttons to retry purchase or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with celebration UI and navigation buttons to view purchased content or return home.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page allowing users to edit name, mobile number, and upload profile photo with validation and upload progress tracking.",
  "frontend/src/pages/ProgressPage.tsx": "Dashboard displaying user test performance metrics, charts (bar and line) for score trends, and progress statistics using Recharts visualization library.",
  "frontend/src/pages/SyllabusPage.tsx": "React component that displays CUET UG syllabus data in a grid of expandable cards, using brand accent utilities for color theming and showing topics per subject with loading states.",
  "frontend/src/utils/accents.ts": "Utility module providing brand color system (red/blue) with Tailwind-safe class strings for consistent styling across cards, badges, buttons, tabs, and other UI elements.",
  "frontend/src/utils/buildInfo.ts": "Exports build metadata including draft version number (64) and build date for version tracking.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with safelist for brand colors (red/blue), extended theme with OKLCH color system, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking feature requests for logo resizing and circular styling, with image requirements for various logo dimensions and favicon formats."
}