{
  "backend/main.mo": "Motoko canister defining user profiles, tests, courses, payments, OTP handling, and access control with various in-memory maps and query/mutation utilities.",
  "feature_evidence.json": "Feature evidence report mapping styling refactor tasks to affected frontend files and components with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and branding updates of key frontend files.",
  "frontend/index.css": "Global Tailwind CSS variables and themes defining red‑blue brand colors for light and dark modes.",
  "frontend/index.html": "HTML entry point containing meta tags, sitemap link, and root app mounting point.",
  "frontend/public/sitemap.xml": "Sitemap XML listing primary site routes with change frequency and priority.",
  "frontend/src/App.tsx": "Main React app handling routing, authentication via Internet Identity and backend session state, global query configuration, and error boundary.",
  "frontend/src/components/Footer.tsx": "A memoized footer component showing brand info, social links, navigation shortcuts, and a dynamic copyright section.",
  "frontend/src/components/Header.tsx": "A memoized header with navigation, branding, authentication controls, and user dropdown logic tied to identity state.",
  "frontend/src/components/LoginModal.tsx": "A modal for mobile OTP login handling OTP send, verification, connection status, and related UI states.",
  "frontend/src/components/MobileLoginModal.tsx": "Empty component file.",
  "frontend/src/components/ProfileSetupModal.tsx": "A profile completion modal allowing users to submit name, mobile, email, and optional photo upload with progress tracking.",
  "frontend/src/components/SignupModal.tsx": "A deprecated signup notice modal directing users to the mobile OTP login flow.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, auto-invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login and logout handling, and initializes AuthClient with persisted identity support.",
  "frontend/src/hooks/useMobileAuth.ts": "Hook managing mobile OTP-based authentication with retries, Internet Identity integration, and actor readiness checks.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, mock tests, courses, syllabi, and session data via the actor API.",
  "frontend/src/index.css": "Tailwind CSS config defining light/dark theme variables, utilities, animations, and UI enhancements.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard rendering tabs for managing users, mock tests, courses, syllabi, and Stripe settings with permission checks.",
  "frontend/src/pages/CoursesPage.tsx": "Page displaying grouped video courses with subject-based accents, loading states, and expandable video lists.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, feature highlights, and navigation buttons based on authentication state.",
  "frontend/src/pages/MockTestsPage.tsx": "Displays available mock tests with subject filters and handles initiating purchases via checkout sessions.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a failure message after unsuccessful payment and provides navigation options to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a success message after completed payment and links to mock tests, courses, and home.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to view and update their profile details, including name, mobile number, and photo upload.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user test results, metrics, and charts summarizing progress and performance.",
  "frontend/src/pages/SyllabusPage.tsx": "Renders the syllabus list with loading state, subject cards, and topic accordions styled using brand accent utilities.",
  "frontend/src/utils/accents.ts": "Provides a simplified red/blue brand accent system with helpers for cards, buttons, tabs, numbered items, and legacy accent mapping.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining brand color safelist, theme extensions, plugins, and container settings.",
  "project_state.json": "Current project metadata including features, issues, theme simplification goals, and new feature requests."
}