{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Exam Xpresss — Restore Draft Version 64 (Frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Align the frontend UI/build metadata with Draft Version 64 so the redeployed draft clearly reflects Version 64.",
      "acceptanceCriteria": [
        "The resulting deployed draft is based on the same code and configuration as Draft Version 64.",
        "The newly deployed draft is accessible and loads successfully in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/buildInfo.ts",
          "operation": "create",
          "description": "Add a small, centralized build metadata module (e.g., draft version identifier set to 64) that can be used by the UI to confirm the restored draft version at runtime."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Render the Draft Version value from frontend/src/utils/buildInfo.ts in a subtle location (e.g., footer) to confirm the app is running Draft Version 64 after redeploy."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure any app-visible version labeling/metadata wiring uses the centralized build info module so the restored Draft Version 64 is consistently represented across the UI."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix frontend build/runtime issues that could prevent successful deployment and core page rendering.",
      "acceptanceCriteria": [
        "Frontend build completes without errors.",
        "Backend canister deploy completes without errors.",
        "App starts and core pages render (Home, Mock Tests, Courses, Syllabus, Profile) without crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Resolve TypeScript build failure risk by safely invoking any actor methods not present in frontend/src/backend.d.ts (e.g., by narrowing/casting) so the frontend build completes without type errors."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Remove redundant nested React Query provider setup (QueryClientProvider) and ensure the app uses a single, consistent QueryClient configuration so core pages can render reliably without provider/context mismatches."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden Stripe checkout session parsing by validating the parsed session object shape before use (especially presence of a non-empty url), preventing runtime crashes during purchase flow on Mock Tests."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify core page navigation/state sync (Home, Mock Tests, Courses, Syllabus, Profile) remains stable after provider/auth changes, and that unauthenticated access handling does not cause render loops or crashes."
        }
      ]
    }
  ]
}