{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify site theme to a consistent 1–2 premium brand colors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Consolidate global theme tokens and utilities so the site uses only 1–2 brand accent colors (plus neutrals) across light/dark mode.",
      "acceptanceCriteria": [
        "Across all pages/components, accent styling is limited to a maximum of two brand colors (plus neutrals like background/foreground/muted/border).",
        "No UI elements (text, borders, rings, icons, buttons, badges, gradients) rely on the rotating accent palette or subject/route-based accent variety.",
        "Light and dark mode remain readable with sufficient contrast, and no broken styles/classes appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global CSS variables and custom utilities to remove multi-accent tokens and multi-stop gradients; redefine accent-related variables/section background gradients to use only the chosen 1–2 premium brand colors while preserving readable light/dark contrast."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Reduce the Tailwind safelist and extended accent color/shadow entries so only the 1–2 chosen brand accent utilities remain (text/bg/border/ring/hover/data-state variants as needed); ensure no unused multi-accent utilities remain referenced by the app."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refactor the accent utility layer to expose a small fixed set of brand accents (max two) and update callers to stop using route/subject/index-based multi-color rotation.",
      "acceptanceCriteria": [
        "Utilities in frontend/src/utils/accents.ts do not produce more than two accent variants.",
        "Pages/components that currently call getAccentByIndex/getRouteAccent/getSubjectAccent (or similar) are updated to use the new fixed brand accent(s).",
        "No Tailwind class generation relies on dynamic/interpolated accent names (i.e., avoid patterns that Tailwind cannot statically detect)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/accents.ts",
          "operation": "modify",
          "description": "Replace the rotating multi-accent palette and route/subject maps with a fixed brand accent API (max two accents). Ensure all returned Tailwind class strings remain literal (no computed class-name interpolation) and keep helpers aligned with the reduced accent set."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update feature/benefit/CTA sections to use the new fixed brand accent utilities instead of getAccentByIndex and any dynamic Tailwind class construction (e.g., remove `hover:${...}` and `hover:border-${...}` patterns) so Tailwind can statically detect all classes."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace hardcoded teal/pink/violet accent usage with the new fixed brand accent(s) from the refactored accents utility so social icons, headings, and highlights no longer mix multiple accents."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update navigation and auth/profile accent styling to use the new fixed brand accent(s); remove route-based accent variability by switching to the refactored accents utilities and ensuring all Tailwind classes are statically defined."
        },
        {
          "path": "frontend/src/pages/CoursesPage.tsx",
          "operation": "modify",
          "description": "Remove subject-based accent variation by switching from getSubjectAccent to the fixed brand accent(s) and update headings/loading states/cards/badges to use only the brand accents."
        },
        {
          "path": "frontend/src/pages/SyllabusPage.tsx",
          "operation": "modify",
          "description": "Remove subject-based accent variation by switching from getSubjectAccent to the fixed brand accent(s) and update headings/loading states/cards/accordion triggers to use only the brand accents."
        },
        {
          "path": "frontend/src/pages/MockTestsPage.tsx",
          "operation": "modify",
          "description": "Remove subject-based accent variation by switching from getSubjectAccent/tab trigger accent rotation to the fixed brand accent(s); ensure TabsTrigger classes and all other accent-related classes remain statically enumerable."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Update metric cards and chart color helpers usage so charts/metrics no longer rotate through many accents; ensure chart colors derive only from the fixed brand accents and remain readable in light/dark mode."
        },
        {
          "path": "frontend/src/pages/PaymentSuccess.tsx",
          "operation": "modify",
          "description": "Replace any non-brand accent usage (e.g., green/violet/teal/etc.) with the fixed brand accent(s) for icons, highlights, and buttons, keeping success messaging readable without introducing new accent colors."
        },
        {
          "path": "frontend/src/pages/PaymentFailure.tsx",
          "operation": "modify",
          "description": "Replace any non-brand accent usage (e.g., red/orange/violet mixes) with the fixed brand accent(s) for icons, highlights, and buttons, maintaining error clarity while adhering to the 1–2 accent limit."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Update profile UI accent styles (rings, buttons, highlights, progress indicators if present) to rely only on the fixed brand accent(s) and remove any lingering multi-accent utility usage."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update key UI surfaces (Header, Footer, Home hero/CTA/sections) to a consistent premium 1–2 color theme and remove multi-accent gradient text/decoration.",
      "acceptanceCriteria": [
        "Header branding (logo ring, title text, nav active/hover styles, auth buttons) uses only the chosen 1–2 brand colors for accents.",
        "Footer social icons, headings, and highlights use only the chosen 1–2 brand colors for accents (no teal/pink/violet mix).",
        "Home page hero/title/CTA and section background gradient utilities use only the chosen 1–2 brand colors for accent/decoration (no multi-accent gradients)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove multi-accent gradient logo text and mixed accent rings/buttons; re-style logo ring, brand title, nav active indicator, hover states, and auth/profile UI so accents use only the fixed 1–2 brand colors."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update footer brand block, section headings, social links, and the copyright/attribution highlight so all accents use only the fixed 1–2 brand colors; remove any teal/pink/violet mixed treatments."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace multi-accent gradient hero title/CTA styling and any multi-accent section decorations with brand-consistent styling; ensure feature cards, benefit list, and CTA section use only the fixed 1–2 brand colors and no dynamic Tailwind class generation."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update custom section background gradient utility classes (e.g., section-bg-gradient-* and border-accent-gradient) to use only the 1–2 brand colors (no teal/violet/pink/amber/cyan blends) while keeping subtle decoration in both themes."
        }
      ]
    }
  ]
}